prickle/ESP32-Unified-Radio/src/bluetooth.cpp
#include "decls.h"
#ifdef BLUETOOTH

lv_obj_t* transportContainer;
lv_obj_t* backBtn;
lv_obj_t* rewBtn;
lv_obj_t* playBtn;
lv_obj_t* playBtnLbl;
lv_obj_t* stopBtn;
lv_obj_t* ffBtn;
lv_obj_t* forwardBtn;

static void backBtn_action(lv_event_t * event);
static void rewBtn_action(lv_event_t * event);
static void playBtn_action(lv_event_t * event);
static void stopBtn_action(lv_event_t * event);
static void ffBtn_action(lv_event_t * event);
static void forwardBtn_action(lv_event_t * event);

bool playButtonState = false;
int currentPlayStatus = ESP_AVRC_PLAYBACK_STOPPED;
int currentSampleRate = 0;
bool currentConnectionState = false;
volatile bool currentStackState = false;
bool gotMetadata = false;
const char * rName = NULL;
esp_bd_addr_t peerAddress = {0};

void passcodeEntered(const char*);

//Bluetooth transport controls
lv_obj_t* createTransportWidget(lv_obj_t* parent) {
  transportContainer = lv_obj_create(parent);
  lv_obj_add_style(transportContainer, &style_groupbox, LV_PART_MAIN);
  lv_obj_clear_flag(transportContainer, LV_OBJ_FLAG_SCROLLABLE);
#if (TFT_WIDTH == 480)
  lv_obj_set_size(transportContainer, 460, 50);
#else
  lv_obj_set_size(transportContainer, 312, 50);
#endif

  backBtn = lv_btn_create(transportContainer);
  lv_obj_set_size(backBtn, 44, 34);
  lv_obj_add_style(backBtn, &style_wp, LV_PART_MAIN);
  lv_obj_add_style(backBtn, &style_bigfont_orange, LV_PART_MAIN);
  lv_obj_add_style(backBtn, &style_bigfont_orange, LV_PART_SELECTED);
  lv_obj_set_pos(backBtn, 2, 0);
  lv_obj_add_event_cb(backBtn, backBtn_action, LV_EVENT_ALL, NULL);
  lv_obj_t * label = lv_label_create(backBtn);
  lv_obj_align(label, LV_ALIGN_CENTER, 0, 0);
  lv_label_set_text(label, LV_SYMBOL_PREV);

  rewBtn = lv_btn_create(transportContainer);
  lv_obj_set_size(rewBtn, 44, 34);
  lv_obj_add_style(rewBtn, &style_wp, LV_PART_MAIN);
  lv_obj_add_style(rewBtn, &style_bigfont_orange, LV_PART_MAIN);
  lv_obj_add_style(rewBtn, &style_bigfont_orange, LV_PART_SELECTED);
  lv_obj_align_to(rewBtn, backBtn, LV_ALIGN_OUT_RIGHT_MID, 6, 0);
  lv_obj_add_event_cb(rewBtn, rewBtn_action, LV_EVENT_ALL, NULL);
  label = lv_label_create(rewBtn);
  lv_obj_align(label, LV_ALIGN_CENTER, 0, 0);
  lv_label_set_text(label, LV_SYMBOL_LEFT);

  playBtn = lv_btn_create(transportContainer);
  lv_obj_set_size(playBtn, 44, 34);
  lv_obj_add_style(playBtn, &style_wp, LV_PART_MAIN);
  lv_obj_add_style(playBtn, &style_bigfont_orange, LV_PART_MAIN);
  lv_obj_add_style(playBtn, &style_bigfont_orange, LV_PART_SELECTED);
  lv_obj_align_to(playBtn, rewBtn, LV_ALIGN_OUT_RIGHT_MID, 6, 0);
  lv_obj_add_event_cb(playBtn, playBtn_action, LV_EVENT_ALL, NULL);
  playBtnLbl = lv_label_create(playBtn);
  lv_obj_align(playBtnLbl, LV_ALIGN_CENTER, 0, 0);
  lv_label_set_text(playBtnLbl, LV_SYMBOL_PLAY);

  stopBtn = lv_btn_create(transportContainer);
  lv_obj_set_size(stopBtn, 44, 34);
  lv_obj_add_style(stopBtn, &style_wp, LV_PART_MAIN);
  lv_obj_add_style(stopBtn, &style_bigfont_orange, LV_PART_MAIN);
  lv_obj_add_style(stopBtn, &style_bigfont_orange, LV_PART_SELECTED);
  lv_obj_align_to(stopBtn, playBtn, LV_ALIGN_OUT_RIGHT_MID, 6, 0);
  lv_obj_add_event_cb(stopBtn, stopBtn_action, LV_EVENT_ALL, NULL);
  label = lv_label_create(stopBtn);
  lv_obj_align(label, LV_ALIGN_CENTER, 0, 0);
  lv_label_set_text(label, LV_SYMBOL_STOP);

  ffBtn = lv_btn_create(transportContainer);
  lv_obj_set_size(ffBtn, 44, 34);
  lv_obj_add_style(ffBtn, &style_wp, LV_PART_MAIN);
  lv_obj_add_style(ffBtn, &style_bigfont_orange, LV_PART_MAIN);
  lv_obj_add_style(ffBtn, &style_bigfont_orange, LV_PART_SELECTED);
  lv_obj_align_to(ffBtn, stopBtn, LV_ALIGN_OUT_RIGHT_MID, 6, 0);
  lv_obj_add_event_cb(ffBtn, ffBtn_action, LV_EVENT_ALL, NULL);
  label = lv_label_create(ffBtn);
  lv_obj_align(label, LV_ALIGN_CENTER, 0, 0);
  lv_label_set_text(label, LV_SYMBOL_RIGHT);

  forwardBtn = lv_btn_create(transportContainer);
  lv_obj_set_size(forwardBtn, 44, 34);
  lv_obj_add_style(forwardBtn, &style_wp, LV_PART_MAIN);
  lv_obj_add_style(forwardBtn, &style_bigfont_orange, LV_PART_MAIN);
  lv_obj_add_style(forwardBtn, &style_bigfont_orange, LV_PART_SELECTED);
  lv_obj_align_to(forwardBtn, ffBtn, LV_ALIGN_OUT_RIGHT_MID, 6, 0);
  lv_obj_add_event_cb(forwardBtn, forwardBtn_action, LV_EVENT_ALL, NULL);
  label = lv_label_create(forwardBtn);
  lv_obj_align(label, LV_ALIGN_CENTER, 0, 0);
  lv_label_set_text(label, LV_SYMBOL_NEXT);
  return transportContainer;  
}

static void backBtn_action(lv_event_t * event) {
  lv_event_code_t code = lv_event_get_code(event);
  if (code == LV_EVENT_PRESSED) passBluetooth(ESP_AVRC_PT_CMD_BACKWARD, ESP_AVRC_PT_CMD_STATE_PRESSED);
  if (code == LV_EVENT_RELEASED) passBluetooth(ESP_AVRC_PT_CMD_BACKWARD, ESP_AVRC_PT_CMD_STATE_RELEASED);
}

static void rewBtn_action(lv_event_t * event) {
  lv_event_code_t code = lv_event_get_code(event);
  if (code == LV_EVENT_PRESSED) passBluetooth(ESP_AVRC_PT_CMD_REWIND, ESP_AVRC_PT_CMD_STATE_PRESSED);
  if (code == LV_EVENT_RELEASED) passBluetooth(ESP_AVRC_PT_CMD_REWIND, ESP_AVRC_PT_CMD_STATE_RELEASED);
}

//Change play button icon from play to pause and back
void updatePlayButton() {
  bool playing = (currentPlayStatus == ESP_AVRC_PLAYBACK_PLAYING) || 
                 (currentPlayStatus == ESP_AVRC_PLAYBACK_FWD_SEEK) || 
                 (currentPlayStatus == ESP_AVRC_PLAYBACK_REV_SEEK);
  if (playButtonState != playing) {
    playButtonState = playing;
    if (playing) {
      lv_label_set_text(playBtnLbl, LV_SYMBOL_PAUSE);
    } else {
      lv_label_set_text(playBtnLbl, LV_SYMBOL_PLAY);
    }
  }
}

static void playBtn_action(lv_event_t * event) {
  lv_event_code_t code = lv_event_get_code(event);
  if (playButtonState) {
    if (code == LV_EVENT_PRESSED) passBluetooth(ESP_AVRC_PT_CMD_PAUSE, ESP_AVRC_PT_CMD_STATE_PRESSED);
    if (code == LV_EVENT_RELEASED) passBluetooth(ESP_AVRC_PT_CMD_PAUSE, ESP_AVRC_PT_CMD_STATE_RELEASED);
  } else {    
    if (code == LV_EVENT_PRESSED) passBluetooth(ESP_AVRC_PT_CMD_PLAY, ESP_AVRC_PT_CMD_STATE_PRESSED);
    if (code == LV_EVENT_RELEASED) passBluetooth(ESP_AVRC_PT_CMD_PLAY, ESP_AVRC_PT_CMD_STATE_RELEASED);
  }
}

static void stopBtn_action(lv_event_t * event) {
  lv_event_code_t code = lv_event_get_code(event);  
  if (code == LV_EVENT_PRESSED) passBluetooth(ESP_AVRC_PT_CMD_STOP, ESP_AVRC_PT_CMD_STATE_PRESSED);
  if (code == LV_EVENT_RELEASED) passBluetooth(ESP_AVRC_PT_CMD_STOP, ESP_AVRC_PT_CMD_STATE_RELEASED);
}

