prickle/ESP32-Unified-Radio/src/bluetooth.cpp
static void ffBtn_action(lv_event_t * event) {
  lv_event_code_t code = lv_event_get_code(event);  
  if (code == LV_EVENT_PRESSED) passBluetooth(ESP_AVRC_PT_CMD_FAST_FORWARD, ESP_AVRC_PT_CMD_STATE_PRESSED);
  if (code == LV_EVENT_RELEASED) passBluetooth(ESP_AVRC_PT_CMD_FAST_FORWARD, ESP_AVRC_PT_CMD_STATE_RELEASED);
}

static void forwardBtn_action(lv_event_t * event) {
  lv_event_code_t code = lv_event_get_code(event);  
  if (code == LV_EVENT_PRESSED) passBluetooth(ESP_AVRC_PT_CMD_FORWARD, ESP_AVRC_PT_CMD_STATE_PRESSED);
  if (code == LV_EVENT_RELEASED) passBluetooth(ESP_AVRC_PT_CMD_FORWARD, ESP_AVRC_PT_CMD_STATE_RELEASED);
}

bool isBtConnected() {
  return currentConnectionState;
}

bool isBtStarted() {
  return currentStackState;
}

//------------------------------------------------------------------------------------
// Passcode window - action required

static lv_obj_t * passcodeWindow;
static lv_obj_t * passcodeKeyboard;
static lv_timer_t * passcodeTimer = NULL;
#define PASSCODE_TIMEOUT 20000

static void passcodeWindow_action(lv_event_t * event);
static void passcodeKeyboard_action(lv_event_t * event);
static void passcodeTimer_action(lv_timer_t * timer);

//Construct the passcode window and pop it up
void createPasscodeWindow(lv_obj_t * page, int y, void(*okFunction)(const char*), bool animated) {
  if (passcodeWindow) {
    lv_obj_del(passcodeWindow);
    animated = false;
  }
  passcodeWindow = lv_win_create(page, 40);
  lv_obj_set_size(passcodeWindow, 208, 170);
  int width = lv_obj_get_content_width(page);
  int x = (width - 208) / 2;
  lv_obj_set_pos(passcodeWindow, x, y);
  lv_obj_add_style(passcodeWindow, &style_win, LV_PART_MAIN);
  lv_obj_set_style_bg_opa(passcodeWindow, LV_OPA_COVER, LV_PART_MAIN);
  lv_obj_t * header = lv_win_get_header(passcodeWindow);
  lv_obj_t * title = lv_textarea_create(header);
  lv_textarea_set_one_line(title, true);
  lv_textarea_set_placeholder_text(title, "Passcode?");
  lv_obj_set_width(title, 80);
  lv_obj_add_style(title, &style_biggerfont, LV_PART_MAIN);
  lv_obj_add_style(header, &style_groupbox, LV_PART_MAIN);

  lv_obj_t * body = lv_win_get_content(passcodeWindow);
  passcodeKeyboard = lv_keyboard_create(body);
  lv_keyboard_set_mode(passcodeKeyboard, LV_KEYBOARD_MODE_NUMBER);
  lv_obj_set_size(passcodeKeyboard, lv_pct(100), lv_pct(100));
  lv_keyboard_set_textarea(passcodeKeyboard, title);
  lv_obj_add_event_cb(keyBoard, passcodeKeyboard_action, LV_EVENT_ALL, NULL);

  lv_obj_t * ok_btn = lv_win_add_btn(passcodeWindow, LV_SYMBOL_OK, 50);           /*Add close button and use built-in close action*/
  lv_obj_add_style(ok_btn, &style_wp, LV_PART_MAIN);  
  lv_obj_add_style(ok_btn, &style_bigfont_orange, LV_PART_MAIN);
  lv_obj_add_style(ok_btn, &style_bigfont_orange, LV_PART_SELECTED);
  lv_obj_add_event_cb(ok_btn, passcodeWindow_action, LV_EVENT_CLICKED, (void*)okFunction);

  lv_obj_t * cancel_btn = lv_win_add_btn(passcodeWindow, LV_SYMBOL_CLOSE, 50);           /*Add close button and use built-in close action*/
  lv_obj_add_style(cancel_btn, &style_wp, LV_PART_MAIN);  
  lv_obj_add_style(cancel_btn, &style_bigfont_orange, LV_PART_MAIN);
  lv_obj_add_style(cancel_btn, &style_bigfont_orange, LV_PART_SELECTED);
  lv_obj_add_event_cb(cancel_btn, passcodeWindow_action, LV_EVENT_CLICKED, NULL);
  if (animated) {
    lv_anim_t a;
    lv_anim_init(&a);
    lv_anim_set_var(&a, passcodeWindow);
    lv_anim_set_values(&a, LV_VER_RES, y);
#pragma GCC diagnostic push                         //Trouble at mill - pay no heed
#pragma GCC diagnostic ignored "-Wcast-function-type"
    lv_anim_set_exec_cb(&a, (lv_anim_exec_xcb_t)lv_obj_set_y);
#pragma GCC diagnostic pop
    lv_anim_set_path_cb(&a, lv_anim_path_ease_out);
    lv_anim_set_time(&a, 500);
    lv_anim_start(&a);
  }
  passcodeTimer = lv_timer_create(passcodeTimer_action, PASSCODE_TIMEOUT, NULL);
}

//Trigger the passcode window popup
void getPasscode(void(*okFunction)(const char*), bool animated) {
#ifdef VUMETER
  createPasscodeWindow(mainWindow, 112, okFunction, animated); 
#else
  createPasscodeWindow(mainWindow, 0, okFunction, animated); 
#endif
}

void passcodeHiddenAction(lv_anim_t * a) {
  lv_obj_del(passcodeWindow);
  passcodeWindow = NULL;  
}

//Close the passcode window
void closePasscode(bool animated) {
  if (passcodeWindow == NULL) return;
  if (passcodeTimer) lv_timer_del(passcodeTimer);
  passcodeTimer = NULL;
  if (animated) {
    lv_anim_t a;
    lv_anim_init(&a);
    lv_anim_set_var(&a, passcodeWindow);
    lv_anim_set_values(&a, lv_obj_get_y(passcodeWindow), LV_VER_RES);
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wcast-function-type"
    lv_anim_set_exec_cb(&a, (lv_anim_exec_xcb_t)lv_obj_set_y);
#pragma GCC diagnostic pop
    lv_anim_set_ready_cb(&a, passcodeHiddenAction);
    lv_anim_set_path_cb(&a, lv_anim_path_ease_in);
    lv_anim_set_time(&a, 500);
    lv_anim_start(&a);
  } else {
    lv_obj_del(passcodeWindow);
    passcodeWindow = NULL;  
  }
}

static void passcodeWindow_action(lv_event_t * event) {
  void (*okFunction)(const char*) = (void(*)(const char*))lv_event_get_user_data(event);
  if (okFunction) (*okFunction)(lv_textarea_get_text(lv_keyboard_get_textarea(passcodeKeyboard)));
  closePasscode(true);
}

static void passcodeTimer_action(lv_timer_t * timer) {
  closePasscode(true);
}

//Send the passcode reply
void passcodeEntered(const char* passcodeStr) {
  uint32_t code = atoi(passcodeStr);
  if (code > 0) {
    authBluetooth(code, true);
  }
}

static void passcodeKeyboard_action(lv_event_t * event) {
  uint32_t res = lv_event_get_code(event);
  if (passcodeTimer) lv_timer_reset(passcodeTimer);
  if(res == LV_EVENT_READY || res == LV_EVENT_CANCEL){
    closePasscode(true);
    if(res == LV_EVENT_READY)
      passcodeEntered(lv_textarea_get_text(lv_keyboard_get_textarea(passcodeKeyboard)));
  
  }
}

//------------------------------------------------------------------
//Bluetooth events
//From main thread context

#define BT_TXT_EVENT 0
#define BT_CONN_EVENT 1
#define BT_VOL_EVENT 2
#define BT_META_EVENT 3
#define BT_STATE_EVENT 4
#define BT_SR_EVENT 5
#define BT_CH_EVENT 6
#define BT_POS_EVENT 7
#define BT_RSSI_EVENT 8
#define BT_RNAME_EVENT 9
#define BT_PASSKEY_EVENT 10
#define BT_PASSREQ_EVENT 11
#define BT_AUTH_EVENT 12

//Called from audio message handler to deal with bluetooth related messages
void bluetoothMessage(uint32_t source, uint32_t val, const char* txt) {
  if (settings->mode != MODE_BT) return;
  if (source == BT_TXT_EVENT) {
    info(TEXT, 0, LV_SYMBOL_BLUETOOTH " %s", txt);
  }
  if (source == BT_AUTH_EVENT) {
    closePasscode(true);
    if (val == ESP_BT_STATUS_SUCCESS) {
      info(TEXT, 0, "Authentication success: %s\r\n", txt);
    } else info(TEXT, 0, "Authentication failed, status:%d\r\n", val);
  }
  else if (source == BT_CONN_EVENT) {
    currentConnectionState = val;
    if (val == ESP_A2D_CONNECTION_STATE_CONNECTING) {
      info(TEXT, 0, LV_SYMBOL_BLUETOOTH " Connecting..");
    }
    else if (val == ESP_A2D_CONNECTION_STATE_CONNECTED) {
      if (rName) {    
        info(TEXT, 0, LV_SYMBOL_BLUETOOTH " Connected to %s", rName);
      } 
      else info(TEXT, 0, LV_SYMBOL_BLUETOOTH " Connected");
      updateUrlEditText();
    }
    else if (val == ESP_A2D_CONNECTION_STATE_DISCONNECTED) {
      info(TEXT, 0, LV_SYMBOL_BLUETOOTH " Disconnected");
      info(NAME, 0, LV_SYMBOL_STOP " Stopped");
      info(NOW, 0, "");
      rName = NULL;
      gotMetadata = false;
      updateUrlEditText();
    }
  }
  else if (source == BT_VOL_EVENT) {
    settings->dabVolume = val * 21.0f / 127.0f; 
    setVolume(settings->dabVolume);
    if (dabVolSlider) {
      lv_slider_set_value(dabVolSlider, settings->dabVolume, LV_ANIM_OFF);
    }
    writeSettings();
  }
  else if (source == BT_META_EVENT) {
    gotMetadata = true;
    if (val == ESP_AVRC_MD_ATTR_TITLE) audio_showstreamtitle(txt);
    else if (val == ESP_AVRC_MD_ATTR_ARTIST) audio_showstation(txt);
    //serial.printf(">: %d: %s\r\n", val, txt);
  }
  else if (source == BT_STATE_EVENT) {
    currentPlayStatus = val;
    uint8_t infoLine = NAME;
    if (gotMetadata) infoLine = TEXT;
    if (currentPlayStatus == ESP_AVRC_PLAYBACK_PLAYING) info(infoLine, 0, LV_SYMBOL_PLAY " Playing");
    else if (currentPlayStatus == ESP_AVRC_PLAYBACK_STOPPED) info(infoLine, 0, LV_SYMBOL_STOP " Stopped");
    else if (currentPlayStatus == ESP_AVRC_PLAYBACK_PAUSED) info(infoLine, 0, LV_SYMBOL_PAUSE " Paused");
    else if (currentPlayStatus == ESP_AVRC_PLAYBACK_FWD_SEEK) info(infoLine, 0, LV_SYMBOL_RIGHT " Fast Forward");
    else if (currentPlayStatus == ESP_AVRC_PLAYBACK_REV_SEEK) info(infoLine, 0, LV_SYMBOL_LEFT, " Rewind");
    updatePlayButton();
  }
  else if (source == BT_SR_EVENT) {
    currentSampleRate = val;
    setSampleRate(currentSampleRate);
  }
  else if (source == BT_CH_EVENT) {
    updateSTMOLabel(val == 1 ? STMO_MONO : STMO_STEREO);    
  }
  else if (source == BT_POS_EVENT) {
    //Not using this right now
  }
  else if (source == BT_RSSI_EVENT) {
    if (val > 128) val = 128;
    val = val * 100 / 128.0f;
    char s[25] = {0};
    snprintf(s, 24, LV_SYMBOL_WIFI " %d%%", val);
    setSigStrengthLbl(s);    
  }
  else if (source == BT_RNAME_EVENT) {
    rName = txt;
    if (currentConnectionState)
      info(TEXT, 0, LV_SYMBOL_BLUETOOTH " Connected to %s", rName);
  }
  else if (source == BT_PASSKEY_EVENT) {
      info(NAME, 10, "Passkey: %d", val);
  }
  else if (source == BT_PASSREQ_EVENT) {
    getPasscode(passcodeEntered, true);
  }

