prickle/ESP32-Unified-Radio/src/bluetooth.cpp
}

//--------------------------------------------------------
//Address handling

bool readPeerAddress() {
  esp_bd_addr_t empty_connection = {0, 0, 0, 0, 0, 0};
  memcpy(peerAddress, settings->hostAddrBt, ESP_BD_ADDR_LEN);
  int result = memcmp(peerAddress, empty_connection, ESP_BD_ADDR_LEN);
  return result != 0;
}

void writePeerAddress(esp_bd_addr_t address) {
  memcpy(settings->hostAddrBt, address, ESP_BD_ADDR_LEN);
  writeSettings();
}

void clearPeerAddress() {
  esp_bd_addr_t cleanBda = {0};
  writePeerAddress(cleanBda);
}

//-------------------------------------------------------
// Threaded below - called from audio thread context

void bt_data_cb(const uint8_t *data, uint32_t len);
void bt_gap_cb(esp_bt_gap_cb_event_t event, esp_bt_gap_cb_param_t *param);
void bt_rc_ct_cb(esp_avrc_ct_cb_event_t event, esp_avrc_ct_cb_param_t *param);
void bt_rc_tg_cb(esp_avrc_tg_cb_event_t event, esp_avrc_tg_cb_param_t *param);
void bt_a2d_cb(esp_a2d_cb_event_t event, esp_a2d_cb_param_t *param);

bool btConnected = false;
bool btVolNotify = false;
bool btPassNotify = false;
bool btAutoConnect = false;
uint8_t btAutoRetry = 0;
unsigned long btAutoTimeout = 0;
uint8_t btVolume = 0;
uint8_t btChannels = 0;
uint16_t btRemoteFeaturesFlag = 0;
int8_t lastRSSI = 0;
char remoteName[ESP_BT_GAP_MAX_BDNAME_LEN];
bool rssiActive = true;

#define BT_AUTOTIMER 2000

// AVRCP used transaction label
#define APP_RC_CT_TL_GET_CAPS            (0)
#define APP_RC_CT_TL_GET_META_DATA       (1)
#define APP_RC_CT_TL_RN_TRACK_CHANGE     (2)
#define APP_RC_CT_TL_RN_PLAYBACK_CHANGE  (3)
#define APP_RC_CT_TL_RN_PLAY_POS_CHANGE  (4)
#define ESP_AVRC_FEAT_FLAG_TG_COVER_ART  (0x0100)                     /*!< TG support Cover Art */


static esp_avrc_rn_evt_cap_mask_t s_avrc_peer_rn_cap;
//Prepare for Bluetooth - started by audio thread
bool initBT() {
  bool fail = false;
  // set up bluetooth classic via bluedroid
  esp_err_t err = esp_bt_controller_mem_release(ESP_BT_MODE_BLE);
  if (err != ESP_OK) { fail = true; log_e("esp_bt_controller_mem_release:%d", err); }
  return (!fail);
}

//Start the Bluetooth stack - called from the audio thread
bool startBT() {
  bool fail = false;
  //Prepare audio output
  setSampleRate(44100);
  setBitsPerSample(16);
  setChannels(2);
  // start bluetooth classic via bluedroid
  if (!btStart()) { fail = true; log_e("btStart"); }
  esp_err_t err = esp_bluedroid_init();
  if (err != ESP_OK) { fail = true; log_e("esp_bluedroid_init:%d", err); }
  err = esp_bluedroid_enable();
  if (err != ESP_OK) { fail = true; log_e("esp_bluedroid_enable:%d", err); }

  // set up device name
  const char *dev_name = RADIONAME;
  err = esp_bt_dev_set_device_name(dev_name);
  if (err != ESP_OK) { fail = true; log_e("esp_bt_dev_set_device_name:%d", err); }

  // initialize AVRCP controller
  err = esp_avrc_ct_init();
  if (err != ESP_OK) { fail = true; log_e("esp_avrc_ct_init:%d", err); }
  err = esp_avrc_ct_register_callback(bt_rc_ct_cb);
  if (err != ESP_OK) { fail = true; log_e("esp_avrc_ct_register_callback:%d", err); }
  err = esp_avrc_tg_init();
  if (err != ESP_OK) { fail = true; log_e("esp_avrc_tg_init:%d", err); }
  err = esp_avrc_tg_register_callback(bt_rc_tg_cb);
  if (err != ESP_OK) { fail = true; log_e("esp_avrc_tg_register_callback:%d", err); }

  esp_avrc_rn_evt_cap_mask_t evt_set = {0};
  esp_avrc_rn_evt_bit_mask_operation(ESP_AVRC_BIT_MASK_OP_SET, &evt_set, ESP_AVRC_RN_VOLUME_CHANGE);
  assert(esp_avrc_tg_set_rn_evt_cap(&evt_set) == ESP_OK);

  // initialize A2DP sink and set the data callback(A2DP is bluetooth audio)
  err = esp_a2d_register_callback(bt_a2d_cb);
  if (err != ESP_OK) { fail = true; log_e("esp_a2d_register_callback:%d", err); }
  err = esp_a2d_sink_register_data_callback(bt_data_cb);
  if (err != ESP_OK) { fail = true; log_e("esp_a2d_sink_register_data_callback:%d", err); }
  err = esp_a2d_sink_init();
  if (err != ESP_OK) { fail = true; log_e("esp_a2d_sink_init:%d", err); }
  
  // set discoverable and connectable mode, wait to be connected
  err = esp_bt_gap_set_scan_mode(ESP_BT_CONNECTABLE, ESP_BT_GENERAL_DISCOVERABLE); // for newer ESP-IDF
  if (err != ESP_OK) { fail = true; log_e("esp_bt_gap_set_scan_mode:%d", err); }
  err = esp_bt_gap_register_callback(bt_gap_cb);
  if (err != ESP_OK) { fail = true; log_e("esp_bt_gap_register_callback:%d", err); }

#if (CONFIG_BT_SSP_ENABLED == true)
  /* Set default parameters for Secure Simple Pairing */
  esp_bt_sp_param_t param_type = ESP_BT_SP_IOCAP_MODE;
  esp_bt_io_cap_t iocap = ESP_BT_IO_CAP_IO;
  err = esp_bt_gap_set_security_param(param_type, &iocap, sizeof(uint8_t));
  if (err != ESP_OK) { fail = true; log_e("esp_bt_gap_set_security_param:%d", err); }
#endif

  esp_bt_pin_type_t pin_type;
  if (settings->pinreqBt) {
    // Set default parameters for Secure Simple Pairing
    esp_bt_sp_param_t param_type = ESP_BT_SP_IOCAP_MODE;
    esp_bt_io_cap_t iocap = ESP_BT_IO_CAP_IN;
    if(settings->pinreqBt == 1) iocap = ESP_BT_IO_CAP_OUT;
    err = esp_bt_gap_set_security_param(param_type, &iocap, sizeof(uint8_t));
    if (err != ESP_OK) { fail = true; log_e("esp_bt_gap_set_security_param:%d", err); }
    // invokes callbacks
    pin_type = ESP_BT_PIN_TYPE_VARIABLE;
  } else {
    // Set default parameters for Legacy Pairing
    esp_bt_sp_param_t param_type = ESP_BT_SP_IOCAP_MODE;
    esp_bt_io_cap_t iocap = ESP_BT_IO_CAP_NONE;
    err = esp_bt_gap_set_security_param(param_type, &iocap, sizeof(uint8_t));
    if (err != ESP_OK) { fail = true; log_e("esp_bt_gap_set_security_param:%d", err); }
    // no callbacks
    pin_type = ESP_BT_PIN_TYPE_FIXED;
  }

  esp_bt_pin_code_t pin_code;
  memcpy(pin_code, settings->pincodeBt, 4);
  err = esp_bt_gap_set_pin(pin_type, 0, pin_code);
  if (err != ESP_OK) { fail = true; log_e("esp_bt_gap_set_pin:%d", err); }

  //Reconnect to last peer
  btAutoConnect = settings->reconnectBt;
  if (!fail && btAutoConnect && (btAutoConnect = readPeerAddress())) {
    btNotify(BT_TXT_EVENT, 0, "Reconnecting to last peer..");
    BTconnect(peerAddress);
    btAutoTimeout = millis() + BT_AUTOTIMER;
  } else {
    if (fail) btNotify(BT_TXT_EVENT, 0, "Bluetooth failed!");
    else btNotify(BT_TXT_EVENT, 0, "Bluetooth ready");
    btAutoTimeout = 0;
  }
  btAutoRetry = 0;
  currentStackState = (!fail);
  return (!fail);
}

void handleBT() {
  if (settings->mode == MODE_BT && btAutoConnect) {
    if (btAutoTimeout && btAutoTimeout < millis()) {
      if (btAutoRetry < 4) {
        char buf[32];
        sprintf(buf, "Searching for peer, attempt %d..", btAutoRetry);
        btNotify(BT_TXT_EVENT, 0, buf);
        BTconnect(peerAddress);
        btAutoRetry++;
        btAutoTimeout = millis() + BT_AUTOTIMER;
      } else {
        btNotify(BT_TXT_EVENT, 0, "Last peer not found.");
        btAutoTimeout = 0;
      }
    }
  }
}

